### Pandas
- python programming language for data manipulation and analysis
- for working with tabular or heterogeneous data

#### Pandas Data Structures
##### Series
- 1Dimention data(index,data)
a fixed-length, ordered dict, mapping of index values to data values
##### DataFrame(sum of many Series)
- 2Dimention data(index,column,data)
collection of columns each of which can be a different data type

In [1]:
import pandas as pd

In [2]:
obj  = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values # values returns data of Series

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index # index returns data of Series

RangeIndex(start=0, stop=4, step=1)

In [5]:
sdata = {'Ohio':350,'Texas':710,'Oregon':160}
obj3 = pd.Series(sdata)
obj3

Ohio      350
Texas     710
Oregon    160
dtype: int64

In [6]:
# you can operate Series as dictionary
obj3['Ohio'] = 200 
obj3

Ohio      200
Texas     710
Oregon    160
dtype: int64

In [7]:
data = {'state':['Ohio','Ohio','Ohio','Nevada'],'year':[2000,2001,2002,2001],'pop':[1.5,1.7,3.6,2.4]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4

In [8]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

- head(a): it shows the top 'a' index value

In [14]:
obj = pd.Series(range(4), index=['a','b','c','d'])
index = obj.index
index[1] = 'd' #error

TypeError: Index does not support mutable operations

In [19]:
import numpy as np
data = pd.DataFrame(np.arange(16).reshape(4,4),index = ['Ohio','Colorado','Utah','NewYork'], columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

#### DateFrame indexing
- Columns: single value or string sequence

- Index: sequence slicing or a boolean array

In [20]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
NewYork      14   12

In [21]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [22]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

#### loc and iloc
- loc: using axis labels
- iloc: using integers

In [23]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [24]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

#### Drop
drop values from the columns by passing axis = 1

in-place without returning a new object 
- obj.drop('b', inplace=True)

In [25]:
data.drop(['Colorado','Ohio'])

         one  two  three  four
Utah       8    9     10    11
NewYork   12   13     14    15

#### Sorting
- sort_index(axis = 0or1)
- sort_values(by = 'column')

In [27]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'], columns = ['d','a','b','c'])
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [28]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [32]:
frame = pd.DataFrame({'b':[4,7,-3],'a':[0,1,0]})
frame.sort_values(by='b')

   b  a
2 -3  0
0  4  0
1  7  1